-- Модуль «Группировка данных» (lab.karpov.courses)
-- Тексты задач перенесены со скриншотов урока.

-- 1
-- С помощью оператора GROUP BY посчитайте количество курьеров мужского и женского пола
-- в таблице couriers.
-- Новую колонку с числом курьеров назовите couriers_count.
-- Результат отсортируйте по этой колонке по возрастанию.
-- Поля в результирующей таблице: sex, couriers_count


-- 2
-- Посчитайте количество созданных и отменённых заказов в таблице user_actions.
-- Новую колонку с числом заказов назовите orders_count.
-- Результат отсортируйте по числу заказов по возрастанию.
-- Поля в результирующей таблице: action, orders_count


-- 3
-- Используя группировку и функцию DATE_TRUNC, приведите все даты к началу месяца
-- и посчитайте, сколько заказов было сделано в каждом из них.
-- Расчёты проведите по таблице orders. Колонку с усечённой датой назовите month,
-- колонку с количеством заказов — orders_count.
-- Результат отсортируйте по месяцам — по возрастанию.
-- Поля в результирующей таблице: month, orders_count


-- 4
-- Используя группировку и функцию DATE_TRUNC, приведите все даты к началу месяца
-- и посчитайте, сколько заказов было сделано и сколько было отменено в каждом из них.
-- В этот раз расчёты проведите по таблице user_actions.
-- Колонку с усечённой датой назовите month, колонку с количеством заказов — orders_count.
-- Результат отсортируйте сначала по месяцам — по возрастанию, затем по типу действия — тоже по возрастанию.
-- Поля в результирующей таблице: month, action, orders_count


-- 5
-- По данным в таблице users посчитайте максимальный порядковый номер месяца среди всех
-- порядковых номеров месяцев рождения пользователей сервиса.
-- С помощью группировки проведите расчёты отдельно в двух группах — для пользователей
-- мужского и женского пола.
-- Новую колонку с максимальным порядковым номером месяца рождения в группах назовите max_month.
-- Преобразуйте значения в новой колонке в формат INTEGER, чтобы порядковый номер был выражен целым числом.
-- Результат отсортируйте по колонке с полом пользователей.
-- Поля в результирующей таблице: sex, max_month


-- 6
-- По данным в таблице users посчитайте порядковый номер месяца рождения самого молодого
-- пользователя сервиса.
-- С помощью группировки проведите расчёты отдельно в двух группах — для пользователей
-- мужского и женского пола.
-- Новую колонку с порядковым номером месяца рождения самого молодого пользователя
-- в группах назовите max_month.
-- Преобразуйте значения в новой колонке в формат INTEGER, чтобы порядковый номер был выражен целым числом.
-- Результат отсортируйте по колонке с полом пользователей.
-- Поля в результирующей таблице: sex, max_month


-- 7
-- Посчитайте максимальный возраст пользователей мужского и женского пола в таблице users.
-- Возраст измерьте числом полных лет.
-- Новую колонку с возрастом назовите max_age.
-- Преобразуйте значения в новой колонке в формат INTEGER, чтобы возраст был выражен целым числом.
-- Результат отсортируйте по новой колонке по возрастанию возраста.
-- Поля в результирующей таблице: sex, max_age


-- 8
-- Разбейте пользователей из таблицы users на группы по возрасту
-- (возраст по-прежнему измеряем числом полных лет) и посчитайте количество пользователей
-- каждой возрастной группы.
-- Колонку с возрастом назовите age, а колонку с числом пользователей — users_count.
-- Преобразуйте значения в колонке с возрастом в формат INTEGER, чтобы возраст был выражен целым числом.
-- Результат отсортируйте по колонке с возрастом по возрастанию.
-- Поля в результирующей таблице: age, users_count


-- 9
-- Вновь разбейте пользователей из таблицы users на группы по возрасту
-- (возраст по-прежнему измеряем количеством полных лет), но теперь добавьте в группировку
-- ещё и пол пользователя. Затем посчитайте количество пользователей в каждой половозрастной группе.
-- Все NULL значения в колонке birth_date заранее отфильтруйте с помощью WHERE.
-- Колонку с возрастом назовите age, а колонку с числом пользователей — users_count,
-- имя колонки с полом оставьте без изменений.
-- Преобразуйте значения в колонке с возрастом в формат INTEGER, чтобы возраст был выражен целым числом.
-- Отсортируйте полученную таблицу сначала по колонке с возрастом по возрастанию,
-- затем по колонке с полом — тоже по возрастанию.
-- Поля в результирующей таблице: age, sex, users_count


-- 10
-- Посчитайте количество товаров в каждом заказе, примените к этим значениям группировку
-- и рассчитайте количество заказов в каждой группе за неделю с 29 августа по 4 сентября
-- 2022 года включительно. Для расчётов используйте данные из таблицы orders.
-- Выведите две колонки: размер заказа и число заказов такого размера за указанный период.
-- Колонки назовите соответственно order_size и orders_count.
-- Результат отсортируйте по возрастанию размера заказа.
-- Поля в результирующей таблице: order_size, orders_count


-- 11
-- Посчитайте количество товаров в каждом заказе, примените к этим значениям группировку
-- и рассчитайте количество заказов в каждой группе. Учитывайте только заказы, оформленные
-- по будням. В результат включите только те размеры заказов, общее число которых превышает 2000.
-- Для расчётов используйте данные из таблицы orders.
-- Выведите две колонки: размер заказа и число заказов такого размера.
-- Колонки назовите соответственно order_size и orders_count.
-- Результат отсортируйте по возрастанию размера заказа.
-- Поля в результирующей таблице: order_size, orders_count


-- 12
-- По данным из таблицы user_actions определите пять пользователей, сделавших в августе
-- 2022 года наибольшее количество заказов.
-- Выведите две колонки — id пользователей и число оформленных ими заказов.
-- Колонку с числом оформленных заказов назовите created_orders.
-- Результат отсортируйте сначала по убыванию числа заказов, сделанных пятью пользователями,
-- затем по возрастанию id этих пользователей.
-- Поля в результирующей таблице: user_id, created_orders


-- 13
-- Из таблицы user_actions отберите пользователей, у которых последний заказ был создан
-- до 8 сентября 2022 года.
-- Выведите только их id, дату создания заказа выводить не нужно.
-- Результат отсортируйте по возрастанию id пользователя.
-- Поле в результирующей таблице: user_id


-- 14
-- Разбейте заказы из таблицы orders на 3 группы в зависимости от количества товаров,
-- попавших в заказ:
--   Малый (от 1 до 3 товаров)
--   Средний (от 4 до 6 товаров)
--   Большой (7 и более товаров)
-- Посчитайте число заказов, попавших в каждую группу.
-- Группы назовите соответственно «Малый», «Средний», «Большой» (без кавычек).
-- Выведите наименования групп и число заказов в них.
-- Колонку с наименованием групп назовите order_size, а колонку с числом заказов — orders_count.
-- Отсортируйте полученную таблицу по колонке с числом заказов по возрастанию.
-- Поля в результирующей таблице: order_size, orders_count


-- 15
-- Разбейте пользователей из таблицы users на 4 возрастные группы:
--   от 18 до 24 лет
--   от 25 до 29 лет
--   от 30 до 35 лет
--   не младше 36
-- Посчитайте число пользователей, попавших в каждую возрастную группу.
-- Группы назовите соответственно '18-24', '25-29', '30-35', '36+' (без кавычек).
-- В расчётах не учитывайте пользователей, у которых не указана дата рождения.
-- Как и в прошлых задачах, в качестве возраста учитывайте число полных лет.
-- Выведите наименования групп и число пользователей в них.
-- Колонку с наименованием групп назовите group_age, а колонку с числом пользователей — users_count.
-- Отсортируйте полученную таблицу по колонке с наименованием групп по возрастанию.
-- Поля в результирующей таблице: group_age, users_count


-- 16
-- Теперь попробуем выяснить, отличается ли средний размер заказа в будние дни и выходные.
-- По данным из таблицы orders рассчитайте средний размер заказа по выходным и будням.
-- Группу с выходными днями (суббота и воскресенье) назовите 'weekend',
-- а группу с будними днями (с понедельника по пятницу) — 'weekdays' (без кавычек).
-- В результат включите две колонки: колонку с группами назовите week_part,
-- а колонку со средним размером заказа — avg_order_size.
-- Средний размер заказа округлите до двух знаков после запятой.
-- Результат отсортируйте по колонке со средним размером заказа — по возрастанию.
-- Поля в результирующей таблице: week_part, avg_order_size


-- 17
-- Для каждого пользователя в таблице user_actions посчитайте общее количество оформленных
-- заказов и долю отменённых заказов.
-- Новые колонки назовите соответственно orders_count и cancel_rate.
-- Колонку с долей отменённых заказов округлите до двух знаков после запятой.
-- В результат включите только тех пользователей, которые оформили больше трёх заказов
-- и у которых показатель cancel_rate составляет не менее 0.5.
-- Результат отсортируйте по возрастанию id пользователя.
-- Поля в результирующей таблице: user_id, orders_count, cancel_rate


-- 18
-- Для каждого дня недели в таблице user_actions посчитайте:
--   1. Общее количество оформленных заказов.
--   2. Общее количество отменённых заказов.
--   3. Общее количество неотменённых заказов (т.е. доставленных).
--   4. Долю неотменённых заказов в общем числе заказов (success rate).
-- Новые колонки назовите соответственно created_orders, canceled_orders, actual_orders и success_rate.
-- Колонку с долей неотменённых заказов округлите до трёх знаков после запятой.
-- Все расчёты проводите за период с 24 августа по 6 сентября 2022 года включительно,
-- чтобы во временной интервал попало ровно количество разных дней недели.
-- Группы сформируйте следующим образом: выделите день недели из даты с помощью функции to_char
-- с параметром Dy, также выделите порядковый номер дня недели с помощью функции date_part
-- с параметром isodow. Далее сгруппируйте данные по двум полям и проведите все необходимые расчёты.
-- В результате должна получиться группировка по двум колонкам: с порядковым номером дней недели
-- и их сокращёнными наименованиями.
-- Результат отсортируйте по возрастанию порядкового номера дня недели.
-- Поля в результирующей таблице: weekday_number, weekday, created_orders, canceled_orders, actual_orders, success_rate

SELECT date_part('isodow', time)::int as weekday_number,
       to_char(time, 'Dy') as weekday,
       count(order_id) filter (WHERE action = 'create_order') as created_orders,
       count(order_id) filter (WHERE action = 'cancel_order') as canceled_orders,
       count(order_id) filter (WHERE action = 'create_order')
         - count(order_id) filter (WHERE action = 'cancel_order') as actual_orders,
       round((count(order_id) filter (WHERE action = 'create_order')
              - count(order_id) filter (WHERE action = 'cancel_order'))::decimal
             / count(order_id) filter (WHERE action = 'create_order'), 3) as success_rate
FROM   user_actions
WHERE  time >= '2022-08-24'
   and time <  '2022-09-07'
GROUP  BY weekday, weekday_number
ORDER  BY weekday_number
